#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```terraform
[command]/home/runner/work/_temp/f4850e15-9415-4fb0-9174-1af7fb2d510f/terraform-bin plan -out=tfplan -no-color
module.ecr_app.data.aws_partition.current: Reading...
module.ecr_pipeline.data.aws_caller_identity.current: Reading...
module.ecr_app.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecr_app.data.aws_caller_identity.current: Reading...
module.s3_alb_logs.data.aws_partition.current: Reading...
module.s3_alb_logs.data.aws_caller_identity.current: Reading...
module.s3_alb_logs.data.aws_region.current: Reading...
module.s3_alb_logs.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_alb_logs.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.ecr_pipeline.data.aws_partition.current: Reading...
module.ecr_pipeline.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecr_pipeline.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]
module.s3_alb_logs.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]
module.ecr_pipeline.data.aws_iam_policy_document.repository[0]: Reading...
module.ecr_pipeline.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1578471098]
module.ecr_app.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]
module.ecr_app.data.aws_iam_policy_document.repository[0]: Reading...
module.ecr_app.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1578471098]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.ecs_app will be created
  + resource "aws_cloudwatch_log_group" "ecs_app" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/aidoctors-app"
      + name_prefix       = (known after apply)
      + region            = "us-east-2"
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name" = "aidoctors-app-logs"
        }
      + tags_all          = {
          + "Name" = "aidoctors-app-logs"
        }
    }

  # aws_cloudwatch_log_group.ecs_datapipeline will be created
  + resource "aws_cloudwatch_log_group" "ecs_datapipeline" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/aidoctors-datapipeline"
      + name_prefix       = (known after apply)
      + region            = "us-east-2"
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name" = "aidoctors-datapipeline-logs"
        }
      + tags_all          = {
          + "Name" = "aidoctors-datapipeline-logs"
        }
    }

  # aws_ecs_service.app will be created
  + resource "aws_ecs_service" "app" {
      + arn                                = (known after apply)
      + availability_zone_rebalancing      = (known after apply)
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "aidoctors-app-service"
      + platform_version                   = (known after apply)
      + region                             = "us-east-2"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name" = "aidoctors-app-service"
        }
      + tags_all                           = {
          + "Name" = "aidoctors-app-service"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_configuration (known after apply)

      + load_balancer {
          + container_name   = "aidoctors-app-container"
          + container_port   = 80
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_service.pipeline will be created
  + resource "aws_ecs_service" "pipeline" {
      + arn                                = (known after apply)
      + availability_zone_rebalancing      = (known after apply)
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "aidoctors-pipeline-service"
      + platform_version                   = (known after apply)
      + region                             = "us-east-2"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name" = "aidoctors-pipeline-service"
        }
      + tags_all                           = {
          + "Name" = "aidoctors-pipeline-service"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_configuration (known after apply)

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.app will be created
  + resource "aws_ecs_task_definition" "app" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "aidoctors-app"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + region                   = "us-east-2"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name" = "aidoctors-app-task-definition"
        }
      + tags_all                 = {
          + "Name" = "aidoctors-app-task-definition"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # aws_ecs_task_definition.pipeline will be created
  + resource "aws_ecs_task_definition" "pipeline" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "aidoctors-pipeline"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + region                   = "us-east-2"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name" = "aidoctors-pipeline-task-definition"
        }
      + tags_all                 = {
          + "Name" = "aidoctors-pipeline-task-definition"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # aws_iam_role.ecs_task_execution_role will be created
  + resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aidoctors-ecs-task-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "aidoctors-ecs-task-execution-role"
        }
      + tags_all              = {
          + "Name" = "aidoctors-ecs-task-execution-role"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.ecs_task_role will be created
  + resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aidoctors-ecs-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "aidoctors-ecs-task-role"
        }
      + tags_all              = {
          + "Name" = "aidoctors-ecs-task-role"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.ecs_task_execution_ecr_policy will be created
  + resource "aws_iam_role_policy" "ecs_task_execution_ecr_policy" {
      + id          = (known after apply)
      + name        = "aidoctors-ecs-task-execution-ecr-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.ecs_task_role_policy will be created
  + resource "aws_iam_role_policy" "ecs_task_role_policy" {
      + id          = (known after apply)
      + name        = "aidoctors-ecs-task-role-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "s3:*",
                          + "ecr:*",
                          + "ecs:*",
                          + "rds:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_task_execution_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "aidoctors-ecs-task-execution-role"
    }

  # aws_route53_record.root will be created
  + resource "aws_route53_record" "root" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "aidoctors.com"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_security_group.ecs_tasks will be created
  + resource "aws_security_group" "ecs_tasks" {
      + arn                    = (known after apply)
      + description            = "Security group for ECS tasks"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic from ALB"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "aidoctors-ecs-tasks-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "aidoctors-ecs-tasks-sg"
        }
      + tags_all               = {
          + "Name" = "aidoctors-ecs-tasks-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # module.alb.data.aws_partition.current[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.alb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = true
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = (known after apply)
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "aidoctors-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + region                                                       = "us-east-2"
      + secondary_ips_auto_assigned_per_subnet                       = (known after apply)
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                                                     = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = (known after apply)
          + enabled = true
        }

      + subnet_mapping (known after apply)
    }

  # module.alb.aws_lb_listener.this["ex-http"] will be created
  + resource "aws_lb_listener" "this" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + region                                                                = "us-east-2"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                                                              = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.alb.aws_lb_target_group.this["aidoctors-application"] will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = "true"
      + name                               = (known after apply)
      + name_prefix                        = "aid"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + region                             = "us-east-2"
      + slow_start                         = 0
      + tags                               = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                           = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.alb.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for aidoctors-alb application load balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "aidoctors-alb-"
      + owner_id               = (known after apply)
      + region                 = "us-east-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "Name"                  = "aidoctors-alb"
          + "terraform-aws-modules" = "alb"
        }
      + vpc_id                 = (known after apply)
    }

  # module.alb.aws_vpc_security_group_egress_rule.this["all"] will be created
  + resource "aws_vpc_security_group_egress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/16"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + region                 = "us-east-2"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "aidoctors-alb-all"
        }
      + tags_all               = {
          + "Name" = "aidoctors-alb-all"
        }
    }

  # module.alb.aws_vpc_security_group_ingress_rule.this["all_http"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "HTTP web traffic"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "us-east-2"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "aidoctors-alb-all_http"
        }
      + tags_all               = {
          + "Name" = "aidoctors-alb-all_http"
        }
      + to_port                = 80
    }

  # module.alb.aws_vpc_security_group_ingress_rule.this["all_https"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "HTTPS web traffic"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "us-east-2"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "aidoctors-alb-all_https"
        }
      + tags_all               = {
          + "Name" = "aidoctors-alb-all_https"
        }
      + to_port                = 443
    }

  # module.ecr_app.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 5 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 5
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Remove untagged images after 7 days"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + region      = "us-east-2"
      + registry_id = (known after apply)
      + repository  = "aidoctors-app"
    }

  # module.ecr_app.aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "aidoctors-app"
      + region               = "us-east-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name" = "aidoctors-app-ecr"
        }
      + tags_all             = {
          + "Name" = "aidoctors-app-ecr"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr_app.aws_ecr_repository_policy.this[0] will be created
  + resource "aws_ecr_repository_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:ListTagsForResource",
                          + "ecr:ListImages",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetLifecyclePolicyPreview",
                          + "ecr:GetLifecyclePolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:DescribeImageScanFindings",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::521538197756:root"
                        }
                      + Sid       = "PrivateReadOnly"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region      = "us-east-2"
      + registry_id = (known after apply)
      + repository  = "aidoctors-app"
    }

  # module.ecr_pipeline.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 5 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 5
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Remove untagged images after 7 days"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + region      = "us-east-2"
      + registry_id = (known after apply)
      + repository  = "aidoctors-pipeline"
    }

  # module.ecr_pipeline.aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "aidoctors-pipeline"
      + region               = "us-east-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name" = "aidoctors-pipeline-ecr"
        }
      + tags_all             = {
          + "Name" = "aidoctors-pipeline-ecr"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr_pipeline.aws_ecr_repository_policy.this[0] will be created
  + resource "aws_ecr_repository_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:ListTagsForResource",
                          + "ecr:ListImages",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetLifecyclePolicyPreview",
                          + "ecr:GetLifecyclePolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:DescribeImageScanFindings",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::521538197756:root"
                        }
                      + Sid       = "PrivateReadOnly"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region      = "us-east-2"
      + registry_id = (known after apply)
      + repository  = "aidoctors-pipeline"
    }

  # module.ecs_cluster.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/aidoctors-cluster"
      + name_prefix       = (known after apply)
      + region            = "us-east-2"
      + retention_in_days = 90
      + skip_destroy      = false
      + tags              = {
          + "Name" = "aidoctors-ecs-cluster"
        }
      + tags_all          = {
          + "Name" = "aidoctors-ecs-cluster"
        }
    }

  # module.ecs_cluster.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "aidoctors-cluster"
      + region   = "us-east-2"
      + tags     = {
          + "Name" = "aidoctors-ecs-cluster"
        }
      + tags_all = {
          + "Name" = "aidoctors-ecs-cluster"
        }

      + configuration {
          + execute_command_configuration {
              + logging = "DEFAULT"
            }
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "FARGATE",
          + "FARGATE_SPOT",
        ]
      + cluster_name       = "aidoctors-cluster"
      + id                 = (known after apply)
      + region             = "us-east-2"

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 50
        }
      + default_capacity_provider_strategy {
          + base              = 20
          + capacity_provider = "FARGATE"
          + weight            = 50
        }
    }

  # module.rds_security_group.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security group for RDS PostgreSQL database"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "aidoctors-rds-sg-"
      + owner_id               = (known after apply)
      + region                 = "us-east-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "aidoctors-rds-security-group"
        }
      + tags_all               = {
          + "Name" = "aidoctors-rds-security-group"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.rds_security_group.aws_security_group_rule.egress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "egress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all outbound traffic"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + region                   = "us-east-2"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.rds_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "PostgreSQL Ingress"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-east-2"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # module.route53_zone.aws_route53_zone.this["aidoctors.com"] will be created
  + resource "aws_route53_zone" "this" {
      + arn                 = (known after apply)
      + comment             = "Hosted zone for AIDoctors application"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "aidoctors.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "Name" = "aidoctors-route53"
        }
      + tags_all            = {
          + "Name" = "aidoctors-route53"
        }
      + zone_id             = (known after apply)
    }

  # module.s3_alb_logs.data.aws_iam_policy_document.combined[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "elb_log_delivery" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "ELBRegionUs-East-2"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::033677994240:root",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
            # (1 unchanged attribute hidden)

          + principals {
              + identifiers = [
                  + "logdelivery.elasticloadbalancing.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lb_log_delivery" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AlbNlbLogDeliveryWrite"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "bucket-owner-full-control",
                ]
              + variable = "s3:x-amz-acl"
            }

          + principals {
              + identifiers = [
                  + "delivery.logs.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetBucketAcl",
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AlbNlbLogDeliveryAclCheck"

          + principals {
              + identifiers = [
                  + "delivery.logs.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.s3_alb_logs.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "aidoctors-alb-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = "us-east-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"    = "aidoctors-alb-logs"
          + "Purpose" = "ALB Access Logs"
        }
      + tags_all                    = {
          + "Name"    = "aidoctors-alb-logs"
          + "Purpose" = "ALB Access Logs"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3_alb_logs.aws_s3_bucket_lifecycle_configuration.this[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "this" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "us-east-2"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "log-retention"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 365
              + expired_object_delete_marker = false
            }

          + filter {
                # (1 unchanged attribute hidden)
            }

          + transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
          + transition {
              + days          = 90
              + storage_class = "GLACIER"
            }
        }
    }

  # module.s3_alb_logs.aws_s3_bucket_ownership_controls.this[0] will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-2"

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.s3_alb_logs.aws_s3_bucket_policy.this[0] will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "us-east-2"
    }

  # module.s3_alb_logs.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "us-east-2"
      + restrict_public_buckets = true
      + skip_destroy            = true
    }

  # module.s3_alb_logs.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-2"

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.s3_alb_logs.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-2"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.vpc.aws_db_subnet_group.database[0] will be created
  + resource "aws_db_subnet_group" "database" {
      + arn                     = (known after apply)
      + description             = "Database subnet group for aidoctors-vpc"
      + id                      = (known after apply)
      + name                    = "aidoctors-vpc"
      + name_prefix             = (known after apply)
      + region                  = "us-east-2"
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "aidoctors-vpc"
        }
      + tags_all                = {
          + "Name" = "aidoctors-vpc"
        }
      + vpc_id                  = (known after apply)
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-2"
      + tags                   = {
          + "Name" = "aidoctors-vpc"
        }
      + tags_all               = {
          + "Name" = "aidoctors-vpc"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + egress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-2"
      + route                  = (known after apply)
      + tags                   = {
          + "Name" = "aidoctors-vpc"
        }
      + tags_all               = {
          + "Name" = "aidoctors-vpc"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "aidoctors-vpc"
        }
      + tags_all               = {
          + "Name" = "aidoctors-vpc"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + region               = "us-east-2"
      + tags                 = {
          + "Name" = "aidoctors-vpc"
        }
      + tags_all             = {
          + "Name" = "aidoctors-vpc"
        }
    }

  # module.vpc.aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + region               = "us-east-2"
      + tags                 = {
          + "Name" = "aidoctors-vpc"
        }
      + tags_all             = {
          + "Name" = "aidoctors-vpc"
        }
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "us-east-2"
      + tags     = {
          + "Name" = "aidoctors-vpc"
        }
      + tags_all = {
          + "Name" = "aidoctors-vpc"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + region                             = "us-east-2"
      + secondary_allocation_ids           = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "aidoctors-vpc"
        }
      + tags_all                           = {
          + "Name" = "aidoctors-vpc"
        }
    }

  # module.vpc.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + region                             = "us-east-2"
      + secondary_allocation_ids           = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "aidoctors-vpc"
        }
      + tags_all                           = {
          + "Name" = "aidoctors-vpc"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "us-east-2"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "us-east-2"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "us-east-2"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-2"
      + route            = (known after apply)
      + tags             = {
          + "Name" = "aidoctors-vpc"
        }
      + tags_all         = {
          + "Name" = "aidoctors-vpc"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-2"
      + route            = (known after apply)
      + tags             = {
          + "Name" = "aidoctors-vpc"
        }
      + tags_all         = {
          + "Name" = "aidoctors-vpc"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-2"
      + route            = (known after apply)
      + tags             = {
          + "Name" = "aidoctors-vpc"
        }
      + tags_all         = {
          + "Name" = "aidoctors-vpc"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[0] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + region         = "us-east-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[1] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + region         = "us-east-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-east-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-east-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-east-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-east-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.database[0] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-2"
      + tags                                           = {
          + "Name" = "aidoctors-vpc"
        }
      + tags_all                                       = {
          + "Name" = "aidoctors-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.database[1] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-2"
      + tags                                           = {
          + "Name" = "aidoctors-vpc"
        }
      + tags_all                                       = {
          + "Name" = "aidoctors-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-2"
      + tags                                           = {
          + "Name" = "aidoctors-vpc"
        }
      + tags_all                                       = {
          + "Name" = "aidoctors-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-2"
      + tags                                           = {
          + "Name" = "aidoctors-vpc"
        }
      + tags_all                                       = {
          + "Name" = "aidoctors-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-2"
      + tags                                           = {
          + "Name" = "aidoctors-vpc"
        }
      + tags_all                                       = {
          + "Name" = "aidoctors-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-2"
      + tags                                           = {
          + "Name" = "aidoctors-vpc"
        }
      + tags_all                                       = {
          + "Name" = "aidoctors-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "us-east-2"
      + tags                                 = {
          + "Name" = "aidoctors-vpc"
        }
      + tags_all                             = {
          + "Name" = "aidoctors-vpc"
        }
    }

  # module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "enhanced_monitoring" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]

          + principals {
              + identifiers = [
                  + "monitoring.rds.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.db.module.db_instance.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/rds/instance/aidoctors-db/postgresql"
      + name_prefix       = (known after apply)
      + region            = "us-east-2"
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name" = "aidoctors-postgres"
        }
      + tags_all          = {
          + "Name" = "aidoctors-postgres"
        }
    }

  # module.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/rds/instance/aidoctors-db/upgrade"
      + name_prefix       = (known after apply)
      + region            = "us-east-2"
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name" = "aidoctors-postgres"
        }
      + tags_all          = {
          + "Name" = "aidoctors-postgres"
        }
    }

  # module.db.module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-06:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "aidoctorsdb"
      + db_subnet_group_name                  = (known after apply)
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + enabled_cloudwatch_logs_exports       = [
          + "postgresql",
          + "upgrade",
        ]
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = "open-source-rds-extended-support-disabled"
      + engine_version                        = "17.6"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = true
      + id                                    = (known after apply)
      + identifier                            = "aidoctors-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t4g.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "mon:00:00-mon:03:00"
      + manage_master_user_password           = true
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 50
      + monitoring_interval                   = 60
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = true
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password_wo                           = (write-only attribute)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + region                                = "us-east-2"
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Name" = "aidoctors-postgres"
        }
      + tags_all                              = {
          + "Name" = "aidoctors-postgres"
        }
      + timezone                              = (known after apply)
      + username                              = "aidoctors_admin"
      + vpc_security_group_ids                = (known after apply)

      + timeouts {}
    }

  # module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0] will be created
  + resource "aws_iam_role" "enhanced_monitoring" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aidoctors-rds-monitoring-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "aidoctors-postgres"
        }
      + tags_all              = {
          + "Name" = "aidoctors-postgres"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0] will be created
  + resource "aws_iam_role_policy_attachment" "enhanced_monitoring" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "aidoctors-rds-monitoring-role"
    }

  # module.db.module.db_instance.aws_secretsmanager_secret_rotation.this[0] will be created
  + resource "aws_secretsmanager_secret_rotation" "this" {
      + id                 = (known after apply)
      + region             = "us-east-2"
      + rotate_immediately = false
      + rotation_enabled   = (known after apply)
      + secret_id          = (known after apply)

      + rotation_rules {
          + schedule_expression = "rate(30 days)"
        }
    }

  # module.db.module.db_parameter_group.aws_db_parameter_group.this[0] will be created
  + resource "aws_db_parameter_group" "this" {
      + arn          = (known after apply)
      + description  = "aidoctors-db parameter group"
      + family       = "postgres17"
      + id           = (known after apply)
      + name         = (known after apply)
      + name_prefix  = "aidoctors-db-"
      + region       = "us-east-2"
      + skip_destroy = false
      + tags         = {
          + "Name" = "aidoctors-db"
        }
      + tags_all     = {
          + "Name" = "aidoctors-db"
        }

      + parameter {
          + apply_method = "immediate"
          + name         = "autovacuum"
          + value        = "1"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "client_encoding"
          + value        = "utf8"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "log_connections"
          + value        = "1"
        }
    }

Plan: 75 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + db_instance_master_user_secret_arn = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: module.ecr_app.data.aws_partition.current: Reading...%0Amodule.ecr_pipeline.data.aws_caller_identity.current: Reading...%0Amodule.ecr_app.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.ecr_app.data.aws_caller_identity.current: Reading...%0Amodule.s3_alb_logs.data.aws_partition.current: Reading...%0Amodule.s3_alb_logs.data.aws_caller_identity.current: Reading...%0Amodule.s3_alb_logs.data.aws_region.current: Reading...%0Amodule.s3_alb_logs.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.s3_alb_logs.data.aws_region.current: Read complete after 0s [id=us-east-2]%0Amodule.ecr_pipeline.data.aws_partition.current: Reading...%0Amodule.ecr_pipeline.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.ecr_pipeline.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]%0Amodule.s3_alb_logs.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]%0Amodule.ecr_pipeline.data.aws_iam_policy_document.repository[0]: Reading...%0Amodule.ecr_pipeline.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1578471098]%0Amodule.ecr_app.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]%0Amodule.ecr_app.data.aws_iam_policy_document.repository[0]: Reading...%0Amodule.ecr_app.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1578471098]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # aws_cloudwatch_log_group.ecs_app will be created%0A  + resource "aws_cloudwatch_log_group" "ecs_app" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + log_group_class   = (known after apply)%0A      + name              = "/ecs/aidoctors-app"%0A      + name_prefix       = (known after apply)%0A      + region            = "us-east-2"%0A      + retention_in_days = 7%0A      + skip_destroy      = false%0A      + tags              = {%0A          + "Name" = "aidoctors-app-logs"%0A        }%0A      + tags_all          = {%0A          + "Name" = "aidoctors-app-logs"%0A        }%0A    }%0A%0A  # aws_cloudwatch_log_group.ecs_datapipeline will be created%0A  + resource "aws_cloudwatch_log_group" "ecs_datapipeline" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + log_group_class   = (known after apply)%0A      + name              = "/ecs/aidoctors-datapipeline"%0A      + name_prefix       = (known after apply)%0A      + region            = "us-east-2"%0A      + retention_in_days = 7%0A      + skip_destroy      = false%0A      + tags              = {%0A          + "Name" = "aidoctors-datapipeline-logs"%0A        }%0A      + tags_all          = {%0A          + "Name" = "aidoctors-datapipeline-logs"%0A        }%0A    }%0A%0A  # aws_ecs_service.app will be created%0A  + resource "aws_ecs_service" "app" {%0A      + arn                                = (known after apply)%0A      + availability_zone_rebalancing      = (known after apply)%0A      + cluster                            = (known after apply)%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 0%0A      + enable_ecs_managed_tags            = false%0A      + enable_execute_command             = false%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "aidoctors-app-service"%0A      + platform_version                   = (known after apply)%0A      + region                             = "us-east-2"%0A      + scheduling_strategy                = "REPLICA"%0A      + tags                               = {%0A          + "Name" = "aidoctors-app-service"%0A        }%0A      + tags_all                           = {%0A          + "Name" = "aidoctors-app-service"%0A        }%0A      + task_definition                    = (known after apply)%0A      + triggers                           = (known after apply)%0A      + wait_for_steady_state              = false%0A%0A      + deployment_configuration (known after apply)%0A%0A      + load_balancer {%0A          + container_name   = "aidoctors-app-container"%0A          + container_port   = 80%0A          + target_group_arn = (known after apply)%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = false%0A          + security_groups  = (known after apply)%0A          + subnets          = (known after apply)%0A        }%0A    }%0A%0A  # aws_ecs_service.pipeline will be created%0A  + resource "aws_ecs_service" "pipeline" {%0A      + arn                                = (known after apply)%0A      + availability_zone_rebalancing      = (known after apply)%0A      + cluster                            = (known after apply)%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 0%0A      + enable_ecs_managed_tags            = false%0A      + enable_execute_command             = false%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "aidoctors-pipeline-service"%0A      + platform_version                   = (known after apply)%0A      + region                             = "us-east-2"%0A      + scheduling_strategy                = "REPLICA"%0A      + tags                               = {%0A          + "Name" = "aidoctors-pipeline-service"%0A        }%0A      + tags_all                           = {%0A          + "Name" = "aidoctors-pipeline-service"%0A        }%0A      + task_definition                    = (known after apply)%0A      + triggers                           = (known after apply)%0A      + wait_for_steady_state              = false%0A%0A      + deployment_configuration (known after apply)%0A%0A      + network_configuration {%0A          + assign_public_ip = false%0A          + security_groups  = (known after apply)%0A          + subnets          = (known after apply)%0A        }%0A    }%0A%0A  # aws_ecs_task_definition.app will be created%0A  + resource "aws_ecs_task_definition" "app" {%0A      + arn                      = (known after apply)%0A      + arn_without_revision     = (known after apply)%0A      + container_definitions    = (known after apply)%0A      + cpu                      = "256"%0A      + enable_fault_injection   = (known after apply)%0A      + execution_role_arn       = (known after apply)%0A      + family                   = "aidoctors-app"%0A      + id                       = (known after apply)%0A      + memory                   = "512"%0A      + network_mode             = "awsvpc"%0A      + region                   = "us-east-2"%0A      + requires_compatibilities = [%0A          + "FARGATE",%0A        ]%0A      + revision                 = (known after apply)%0A      + skip_destroy             = false%0A      + tags                     = {%0A          + "Name" = "aidoctors-app-task-definition"%0A        }%0A      + tags_all                 = {%0A          + "Name" = "aidoctors-app-task-definition"%0A        }%0A      + task_role_arn            = (known after apply)%0A      + track_latest             = false%0A    }%0A%0A  # aws_ecs_task_definition.pipeline will be created%0A  + resource "aws_ecs_task_definition" "pipeline" {%0A      + arn                      = (known after apply)%0A      + arn_without_revision     = (known after apply)%0A      + container_definitions    = (known after apply)%0A      + cpu                      = "512"%0A      + enable_fault_injection   = (known after apply)%0A      + execution_role_arn       = (known after apply)%0A      + family                   = "aidoctors-pipeline"%0A      + id                       = (known after apply)%0A      + memory                   = "1024"%0A      + network_mode             = "awsvpc"%0A      + region                   = "us-east-2"%0A      + requires_compatibilities = [%0A          + "FARGATE",%0A        ]%0A      + revision                 = (known after apply)%0A      + skip_destroy             = false%0A      + tags                     = {%0A          + "Name" = "aidoctors-pipeline-task-definition"%0A        }%0A      + tags_all                 = {%0A          + "Name" = "aidoctors-pipeline-task-definition"%0A        }%0A      + task_role_arn            = (known after apply)%0A      + track_latest             = false%0A    }%0A%0A  # aws_iam_role.ecs_task_execution_role will be created%0A  + resource "aws_iam_role" "ecs_task_execution_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ecs-tasks.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "aidoctors-ecs-task-execution-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags                  = {%0A          + "Name" = "aidoctors-ecs-task-execution-role"%0A        }%0A      + tags_all              = {%0A          + "Name" = "aidoctors-ecs-task-execution-role"%0A        }%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy (known after apply)%0A    }%0A%0A  # aws_iam_role.ecs_task_role will be created%0A  + resource "aws_iam_role" "ecs_task_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ecs-tasks.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "aidoctors-ecs-task-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags                  = {%0A          + "Name" = "aidoctors-ecs-task-role"%0A        }%0A      + tags_all              = {%0A          + "Name" = "aidoctors-ecs-task-role"%0A        }%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy (known after apply)%0A    }%0A%0A  # aws_iam_role_policy.ecs_task_execution_ecr_policy will be created%0A  + resource "aws_iam_role_policy" "ecs_task_execution_ecr_policy" {%0A      + id          = (known after apply)%0A      + name        = "aidoctors-ecs-task-execution-ecr-policy"%0A      + name_prefix = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "ecr:GetAuthorizationToken",%0A                          + "ecr:BatchCheckLayerAvailability",%0A                          + "ecr:GetDownloadUrlForLayer",%0A                          + "ecr:BatchGetImage",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "logs:CreateLogGroup",%0A                          + "logs:CreateLogStream",%0A                          + "logs:PutLogEvents",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + role        = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy.ecs_task_role_policy will be created%0A  + resource "aws_iam_role_policy" "ecs_task_role_policy" {%0A      + id          = (known after apply)%0A      + name        = "aidoctors-ecs-task-role-policy"%0A      + name_prefix = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "logs:CreateLogGroup",%0A                          + "logs:CreateLogStream",%0A                          + "logs:PutLogEvents",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "s3:*",%0A                          + "ecr:*",%0A                          + "ecs:*",%0A                          + "rds:*",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + role        = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.ecs_task_execution_role_policy will be created%0A  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"%0A      + role       = "aidoctors-ecs-task-execution-role"%0A    }%0A%0A  # aws_route53_record.root will be created%0A  + resource "aws_route53_record" "root" {%0A      + allow_overwrite = (known after apply)%0A      + fqdn            = (known after apply)%0A      + id              = (known after apply)%0A      + name            = "aidoctors.com"%0A      + type            = "A"%0A      + zone_id         = (known after apply)%0A%0A      + alias {%0A          + evaluate_target_health = true%0A          + name                   = (known after apply)%0A          + zone_id                = (known after apply)%0A        }%0A    }%0A%0A  # aws_security_group.ecs_tasks will be created%0A  + resource "aws_security_group" "ecs_tasks" {%0A      + arn                    = (known after apply)%0A      + description            = "Security group for ECS tasks"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "Allow all outbound traffic"%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = []%0A              + description      = "Allow traffic from ALB"%0A              + from_port        = 80%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = (known after apply)%0A              + self             = false%0A              + to_port          = 80%0A            },%0A        ]%0A      + name                   = "aidoctors-ecs-tasks-sg"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + region                 = "us-east-2"%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name" = "aidoctors-ecs-tasks-sg"%0A        }%0A      + tags_all               = {%0A          + "Name" = "aidoctors-ecs-tasks-sg"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # module.alb.data.aws_partition.current[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_partition" "current" {%0A      + dns_suffix         = (known after apply)%0A      + id                 = (known after apply)%0A      + partition          = (known after apply)%0A      + reverse_dns_prefix = (known after apply)%0A    }%0A%0A  # module.alb.aws_lb.this[0] will be created%0A  + resource "aws_lb" "this" {%0A      + arn                                                          = (known after apply)%0A      + arn_suffix                                                   = (known after apply)%0A      + client_keep_alive                                            = 3600%0A      + desync_mitigation_mode                                       = "defensive"%0A      + dns_name                                                     = (known after apply)%0A      + drop_invalid_header_fields                                   = true%0A      + enable_deletion_protection                                   = true%0A      + enable_http2                                                 = true%0A      + enable_tls_version_and_cipher_suite_headers                  = false%0A      + enable_waf_fail_open                                         = false%0A      + enable_xff_client_port                                       = false%0A      + enable_zonal_shift                                           = false%0A      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)%0A      + id                                                           = (known after apply)%0A      + idle_timeout                                                 = 60%0A      + internal                                                     = (known after apply)%0A      + ip_address_type                                              = (known after apply)%0A      + load_balancer_type                                           = "application"%0A      + name                                                         = "aidoctors-alb"%0A      + name_prefix                                                  = (known after apply)%0A      + preserve_host_header                                         = false%0A      + region                                                       = "us-east-2"%0A      + secondary_ips_auto_assigned_per_subnet                       = (known after apply)%0A      + security_groups                                              = (known after apply)%0A      + subnets                                                      = (known after apply)%0A      + tags                                                         = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + tags_all                                                     = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + vpc_id                                                       = (known after apply)%0A      + xff_header_processing_mode                                   = "append"%0A      + zone_id                                                      = (known after apply)%0A%0A      + access_logs {%0A          + bucket  = (known after apply)%0A          + enabled = true%0A        }%0A%0A      + subnet_mapping (known after apply)%0A    }%0A%0A  # module.alb.aws_lb_listener.this["ex-http"] will be created%0A  + resource "aws_lb_listener" "this" {%0A      + arn                                                                   = (known after apply)%0A      + id                                                                    = (known after apply)%0A      + load_balancer_arn                                                     = (known after apply)%0A      + port                                                                  = 80%0A      + protocol                                                              = "HTTP"%0A      + region                                                                = "us-east-2"%0A      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)%0A      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)%0A      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)%0A      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)%0A      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)%0A      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)%0A      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)%0A      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)%0A      + routing_http_response_access_control_max_age_header_value             = (known after apply)%0A      + routing_http_response_content_security_policy_header_value            = (known after apply)%0A      + routing_http_response_server_enabled                                  = (known after apply)%0A      + routing_http_response_strict_transport_security_header_value          = (known after apply)%0A      + routing_http_response_x_content_type_options_header_value             = (known after apply)%0A      + routing_http_response_x_frame_options_header_value                    = (known after apply)%0A      + ssl_policy                                                            = (known after apply)%0A      + tags                                                                  = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + tags_all                                                              = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + tcp_idle_timeout_seconds                                              = (known after apply)%0A%0A      + default_action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A%0A      + mutual_authentication (known after apply)%0A    }%0A%0A  # module.alb.aws_lb_target_group.this["aidoctors-application"] will be created%0A  + resource "aws_lb_target_group" "this" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = (known after apply)%0A      + deregistration_delay               = "30"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancer_arns                 = (known after apply)%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + load_balancing_anomaly_mitigation  = (known after apply)%0A      + load_balancing_cross_zone_enabled  = "true"%0A      + name                               = (known after apply)%0A      + name_prefix                        = "aid"%0A      + port                               = 80%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + region                             = "us-east-2"%0A      + slow_start                         = 0%0A      + tags                               = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + tags_all                           = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + target_type                        = "ip"%0A      + vpc_id                             = (known after apply)%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 2%0A          + interval            = 30%0A          + matcher             = "200"%0A          + path                = "/"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = 5%0A          + unhealthy_threshold = 3%0A        }%0A%0A      + stickiness (known after apply)%0A%0A      + target_failover (known after apply)%0A%0A      + target_group_health (known after apply)%0A%0A      + target_health_state (known after apply)%0A    }%0A%0A  # module.alb.aws_security_group.this[0] will be created%0A  + resource "aws_security_group" "this" {%0A      + arn                    = (known after apply)%0A      + description            = "Security group for aidoctors-alb application load balancer"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = "aidoctors-alb-"%0A      + owner_id               = (known after apply)%0A      + region                 = "us-east-2"%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + tags_all               = {%0A          + "Name"                  = "aidoctors-alb"%0A          + "terraform-aws-modules" = "alb"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # module.alb.aws_vpc_security_group_egress_rule.this["all"] will be created%0A  + resource "aws_vpc_security_group_egress_rule" "this" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "10.0.0.0/16"%0A      + id                     = (known after apply)%0A      + ip_protocol            = "-1"%0A      + region                 = "us-east-2"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "aidoctors-alb-all"%0A        }%0A      + tags_all               = {%0A          + "Name" = "aidoctors-alb-all"%0A        }%0A    }%0A%0A  # module.alb.aws_vpc_security_group_ingress_rule.this["all_http"] will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "this" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + description            = "HTTP web traffic"%0A      + from_port              = 80%0A      + id                     = (known after apply)%0A      + ip_protocol            = "tcp"%0A      + region                 = "us-east-2"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "aidoctors-alb-all_http"%0A        }%0A      + tags_all               = {%0A          + "Name" = "aidoctors-alb-all_http"%0A        }%0A      + to_port                = 80%0A    }%0A%0A  # module.alb.aws_vpc_security_group_ingress_rule.this["all_https"] will be created%0A  + resource "aws_vpc_security_group_ingress_rule" "this" {%0A      + arn                    = (known after apply)%0A      + cidr_ipv4              = "0.0.0.0/0"%0A      + description            = "HTTPS web traffic"%0A      + from_port              = 443%0A      + id                     = (known after apply)%0A      + ip_protocol            = "tcp"%0A      + region                 = "us-east-2"%0A      + security_group_id      = (known after apply)%0A      + security_group_rule_id = (known after apply)%0A      + tags                   = {%0A          + "Name" = "aidoctors-alb-all_https"%0A        }%0A      + tags_all               = {%0A          + "Name" = "aidoctors-alb-all_https"%0A        }%0A      + to_port                = 443%0A    }%0A%0A  # module.ecr_app.aws_ecr_lifecycle_policy.this[0] will be created%0A  + resource "aws_ecr_lifecycle_policy" "this" {%0A      + id          = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + rules = [%0A                  + {%0A                      + action       = {%0A                          + type = "expire"%0A                        }%0A                      + description  = "Keep last 5 images"%0A                      + rulePriority = 1%0A                      + selection    = {%0A                          + countNumber   = 5%0A                          + countType     = "imageCountMoreThan"%0A                          + tagPrefixList = [%0A                              + "v",%0A                            ]%0A                          + tagStatus     = "tagged"%0A                        }%0A                    },%0A                  + {%0A                      + action       = {%0A                          + type = "expire"%0A                        }%0A                      + description  = "Remove untagged images after 7 days"%0A                      + rulePriority = 2%0A                      + selection    = {%0A                          + countNumber = 7%0A                          + countType   = "sinceImagePushed"%0A                          + countUnit   = "days"%0A                          + tagStatus   = "untagged"%0A                        }%0A                    },%0A                ]%0A            }%0A        )%0A      + region      = "us-east-2"%0A      + registry_id = (known after apply)%0A      + repository  = "aidoctors-app"%0A    }%0A%0A  # module.ecr_app.aws_ecr_repository.this[0] will be created%0A  + resource "aws_ecr_repository" "this" {%0A      + arn                  = (known after apply)%0A      + force_delete         = true%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "IMMUTABLE"%0A      + name                 = "aidoctors-app"%0A      + region               = "us-east-2"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags                 = {%0A          + "Name" = "aidoctors-app-ecr"%0A        }%0A      + tags_all             = {%0A          + "Name" = "aidoctors-app-ecr"%0A        }%0A%0A      + encryption_configuration {%0A          + encryption_type = "AES256"%0A          + kms_key         = (known after apply)%0A        }%0A%0A      + image_scanning_configuration {%0A          + scan_on_push = true%0A        }%0A    }%0A%0A  # module.ecr_app.aws_ecr_repository_policy.this[0] will be created%0A  + resource "aws_ecr_repository_policy" "this" {%0A      + id          = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = [%0A                          + "ecr:ListTagsForResource",%0A                          + "ecr:ListImages",%0A                          + "ecr:GetRepositoryPolicy",%0A                          + "ecr:GetLifecyclePolicyPreview",%0A                          + "ecr:GetLifecyclePolicy",%0A                          + "ecr:GetDownloadUrlForLayer",%0A                          + "ecr:GetAuthorizationToken",%0A                          + "ecr:DescribeRepositories",%0A                          + "ecr:DescribeImages",%0A                          + "ecr:DescribeImageScanFindings",%0A                          + "ecr:BatchGetImage",%0A                          + "ecr:BatchCheckLayerAvailability",%0A                        ]%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + AWS = "arn:aws:iam::521538197756:root"%0A                        }%0A                      + Sid       = "PrivateReadOnly"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + region      = "us-east-2"%0A      + registry_id = (known after apply)%0A      + repository  = "aidoctors-app"%0A    }%0A%0A  # module.ecr_pipeline.aws_ecr_lifecycle_policy.this[0] will be created%0A  + resource "aws_ecr_lifecycle_policy" "this" {%0A      + id          = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + rules = [%0A                  + {%0A                      + action       = {%0A                          + type = "expire"%0A                        }%0A                      + description  = "Keep last 5 images"%0A                      + rulePriority = 1%0A                      + selection    = {%0A                          + countNumber   = 5%0A                          + countType     = "imageCountMoreThan"%0A                          + tagPrefixList = [%0A                              + "v",%0A                            ]%0A                          + tagStatus     = "tagged"%0A                        }%0A                    },%0A                  + {%0A                      + action       = {%0A                          + type = "expire"%0A                        }%0A                      + description  = "Remove untagged images after 7 days"%0A                      + rulePriority = 2%0A                      + selection    = {%0A                          + countNumber = 7%0A                          + countType   = "sinceImagePushed"%0A                          + countUnit   = "days"%0A                          + tagStatus   = "untagged"%0A                        }%0A                    },%0A                ]%0A            }%0A        )%0A      + region      = "us-east-2"%0A      + registry_id = (known after apply)%0A      + repository  = "aidoctors-pipeline"%0A    }%0A%0A  # module.ecr_pipeline.aws_ecr_repository.this[0] will be created%0A  + resource "aws_ecr_repository" "this" {%0A      + arn                  = (known after apply)%0A      + force_delete         = true%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "IMMUTABLE"%0A      + name                 = "aidoctors-pipeline"%0A      + region               = "us-east-2"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags                 = {%0A          + "Name" = "aidoctors-pipeline-ecr"%0A        }%0A      + tags_all             = {%0A          + "Name" = "aidoctors-pipeline-ecr"%0A        }%0A%0A      + encryption_configuration {%0A          + encryption_type = "AES256"%0A          + kms_key         = (known after apply)%0A        }%0A%0A      + image_scanning_configuration {%0A          + scan_on_push = true%0A        }%0A    }%0A%0A  # module.ecr_pipeline.aws_ecr_repository_policy.this[0] will be created%0A  + resource "aws_ecr_repository_policy" "this" {%0A      + id          = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = [%0A                          + "ecr:ListTagsForResource",%0A                          + "ecr:ListImages",%0A                          + "ecr:GetRepositoryPolicy",%0A                          + "ecr:GetLifecyclePolicyPreview",%0A                          + "ecr:GetLifecyclePolicy",%0A                          + "ecr:GetDownloadUrlForLayer",%0A                          + "ecr:GetAuthorizationToken",%0A                          + "ecr:DescribeRepositories",%0A                          + "ecr:DescribeImages",%0A                          + "ecr:DescribeImageScanFindings",%0A                          + "ecr:BatchGetImage",%0A                          + "ecr:BatchCheckLayerAvailability",%0A                        ]%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + AWS = "arn:aws:iam::521538197756:root"%0A                        }%0A                      + Sid       = "PrivateReadOnly"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + region      = "us-east-2"%0A      + registry_id = (known after apply)%0A      + repository  = "aidoctors-pipeline"%0A    }%0A%0A  # module.ecs_cluster.aws_cloudwatch_log_group.this[0] will be created%0A  + resource "aws_cloudwatch_log_group" "this" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + log_group_class   = (known after apply)%0A      + name              = "/aws/ecs/aidoctors-cluster"%0A      + name_prefix       = (known after apply)%0A      + region            = "us-east-2"%0A      + retention_in_days = 90%0A      + skip_destroy      = false%0A      + tags              = {%0A          + "Name" = "aidoctors-ecs-cluster"%0A        }%0A      + tags_all          = {%0A          + "Name" = "aidoctors-ecs-cluster"%0A        }%0A    }%0A%0A  # module.ecs_cluster.aws_ecs_cluster.this[0] will be created%0A  + resource "aws_ecs_cluster" "this" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + name     = "aidoctors-cluster"%0A      + region   = "us-east-2"%0A      + tags     = {%0A          + "Name" = "aidoctors-ecs-cluster"%0A        }%0A      + tags_all = {%0A          + "Name" = "aidoctors-ecs-cluster"%0A        }%0A%0A      + configuration {%0A          + execute_command_configuration {%0A              + logging = "DEFAULT"%0A            }%0A        }%0A%0A      + setting {%0A          + name  = "containerInsights"%0A          + value = "enabled"%0A        }%0A    }%0A%0A  # module.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0] will be created%0A  + resource "aws_ecs_cluster_capacity_providers" "this" {%0A      + capacity_providers = [%0A          + "FARGATE",%0A          + "FARGATE_SPOT",%0A        ]%0A      + cluster_name       = "aidoctors-cluster"%0A      + id                 = (known after apply)%0A      + region             = "us-east-2"%0A%0A      + default_capacity_provider_strategy {%0A          + base              = 0%0A          + capacity_provider = "FARGATE_SPOT"%0A          + weight            = 50%0A        }%0A      + default_capacity_provider_strategy {%0A          + base              = 20%0A          + capacity_provider = "FARGATE"%0A          + weight            = 50%0A        }%0A    }%0A%0A  # module.rds_security_group.aws_security_group.this_name_prefix[0] will be created%0A  + resource "aws_security_group" "this_name_prefix" {%0A      + arn                    = (known after apply)%0A      + description            = "Security group for RDS PostgreSQL database"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = "aidoctors-rds-sg-"%0A      + owner_id               = (known after apply)%0A      + region                 = "us-east-2"%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name" = "aidoctors-rds-security-group"%0A        }%0A      + tags_all               = {%0A          + "Name" = "aidoctors-rds-security-group"%0A        }%0A      + vpc_id                 = (known after apply)%0A%0A      + timeouts {%0A          + create = "10m"%0A          + delete = "15m"%0A        }%0A    }%0A%0A  # module.rds_security_group.aws_security_group_rule.egress_with_cidr_blocks[0] will be created%0A  + resource "aws_security_group_rule" "egress_with_cidr_blocks" {%0A      + cidr_blocks              = [%0A          + "0.0.0.0/0",%0A        ]%0A      + description              = "Allow all outbound traffic"%0A      + from_port                = 0%0A      + id                       = (known after apply)%0A      + protocol                 = "-1"%0A      + region                   = "us-east-2"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 0%0A      + type                     = "egress"%0A    }%0A%0A  # module.rds_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created%0A  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {%0A      + cidr_blocks              = [%0A          + "10.0.0.0/16",%0A        ]%0A      + description              = "PostgreSQL Ingress"%0A      + from_port                = 5432%0A      + id                       = (known after apply)%0A      + protocol                 = "tcp"%0A      + region                   = "us-east-2"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 5432%0A      + type                     = "ingress"%0A    }%0A%0A  # module.route53_zone.aws_route53_zone.this["aidoctors.com"] will be created%0A  + resource "aws_route53_zone" "this" {%0A      + arn                 = (known after apply)%0A      + comment             = "Hosted zone for AIDoctors application"%0A      + force_destroy       = false%0A      + id                  = (known after apply)%0A      + name                = "aidoctors.com"%0A      + name_servers        = (known after apply)%0A      + primary_name_server = (known after apply)%0A      + tags                = {%0A          + "Name" = "aidoctors-route53"%0A        }%0A      + tags_all            = {%0A          + "Name" = "aidoctors-route53"%0A        }%0A      + zone_id             = (known after apply)%0A    }%0A%0A  # module.s3_alb_logs.data.aws_iam_policy_document.combined[0] will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "combined" {%0A      + id                      = (known after apply)%0A      + json                    = (known after apply)%0A      + minified_json           = (known after apply)%0A      + source_policy_documents = (known after apply)%0A    }%0A%0A  # module.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0] will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "elb_log_delivery" {%0A      + id            = (known after apply)%0A      + json          = (known after apply)%0A      + minified_json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "s3:PutObject",%0A            ]%0A          + effect    = "Allow"%0A          + resources = [%0A              + (known after apply),%0A            ]%0A          + sid       = "ELBRegionUs-East-2"%0A%0A          + principals {%0A              + identifiers = [%0A                  + "arn:aws:iam::033677994240:root",%0A                ]%0A              + type        = "AWS"%0A            }%0A        }%0A      + statement {%0A          + actions   = [%0A              + "s3:PutObject",%0A            ]%0A          + effect    = "Allow"%0A          + resources = [%0A              + (known after apply),%0A            ]%0A            # (1 unchanged attribute hidden)%0A%0A          + principals {%0A              + identifiers = [%0A                  + "logdelivery.elasticloadbalancing.amazonaws.com",%0A                ]%0A              + type        = "Service"%0A            }%0A        }%0A    }%0A%0A  # module.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0] will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "lb_log_delivery" {%0A      + id            = (known after apply)%0A      + json          = (known after apply)%0A      + minified_json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "s3:PutObject",%0A            ]%0A          + effect    = "Allow"%0A          + resources = [%0A              + (known after apply),%0A            ]%0A          + sid       = "AlbNlbLogDeliveryWrite"%0A%0A          + condition {%0A              + test     = "StringEquals"%0A              + values   = [%0A                  + "bucket-owner-full-control",%0A                ]%0A              + variable = "s3:x-amz-acl"%0A            }%0A%0A          + principals {%0A              + identifiers = [%0A                  + "delivery.logs.amazonaws.com",%0A                ]%0A              + type        = "Service"%0A            }%0A        }%0A      + statement {%0A          + actions   = [%0A              + "s3:GetBucketAcl",%0A              + "s3:ListBucket",%0A            ]%0A          + effect    = "Allow"%0A          + resources = [%0A              + (known after apply),%0A            ]%0A          + sid       = "AlbNlbLogDeliveryAclCheck"%0A%0A          + principals {%0A              + identifiers = [%0A                  + "delivery.logs.amazonaws.com",%0A                ]%0A              + type        = "Service"%0A            }%0A        }%0A    }%0A%0A  # module.s3_alb_logs.aws_s3_bucket.this[0] will be created%0A  + resource "aws_s3_bucket" "this" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "aidoctors-alb-logs"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_region               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = false%0A      + policy                      = (known after apply)%0A      + region                      = "us-east-2"%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Name"    = "aidoctors-alb-logs"%0A          + "Purpose" = "ALB Access Logs"%0A        }%0A      + tags_all                    = {%0A          + "Name"    = "aidoctors-alb-logs"%0A          + "Purpose" = "ALB Access Logs"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A%0A      + cors_rule (known after apply)%0A%0A      + grant (known after apply)%0A%0A      + lifecycle_rule (known after apply)%0A%0A      + logging (known after apply)%0A%0A      + object_lock_configuration (known after apply)%0A%0A      + replication_configuration (known after apply)%0A%0A      + server_side_encryption_configuration (known after apply)%0A%0A      + versioning (known after apply)%0A%0A      + website (known after apply)%0A    }%0A%0A  # module.s3_alb_logs.aws_s3_bucket_lifecycle_configuration.this[0] will be created%0A  + resource "aws_s3_bucket_lifecycle_configuration" "this" {%0A      + bucket                                 = (known after apply)%0A      + expected_bucket_owner                  = (known after apply)%0A      + id                                     = (known after apply)%0A      + region                                 = "us-east-2"%0A      + transition_default_minimum_object_size = "all_storage_classes_128K"%0A%0A      + rule {%0A          + id     = "log-retention"%0A          + status = "Enabled"%0A            # (1 unchanged attribute hidden)%0A%0A          + expiration {%0A              + days                         = 365%0A              + expired_object_delete_marker = false%0A            }%0A%0A          + filter {%0A                # (1 unchanged attribute hidden)%0A            }%0A%0A          + transition {%0A              + days          = 30%0A              + storage_class = "STANDARD_IA"%0A            }%0A          + transition {%0A              + days          = 90%0A              + storage_class = "GLACIER"%0A            }%0A        }%0A    }%0A%0A  # module.s3_alb_logs.aws_s3_bucket_ownership_controls.this[0] will be created%0A  + resource "aws_s3_bucket_ownership_controls" "this" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + region = "us-east-2"%0A%0A      + rule {%0A          + object_ownership = "ObjectWriter"%0A        }%0A    }%0A%0A  # module.s3_alb_logs.aws_s3_bucket_policy.this[0] will be created%0A  + resource "aws_s3_bucket_policy" "this" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + policy = (known after apply)%0A      + region = "us-east-2"%0A    }%0A%0A  # module.s3_alb_logs.aws_s3_bucket_public_access_block.this[0] will be created%0A  + resource "aws_s3_bucket_public_access_block" "this" {%0A      + block_public_acls       = true%0A      + block_public_policy     = true%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = true%0A      + region                  = "us-east-2"%0A      + restrict_public_buckets = true%0A      + skip_destroy            = true%0A    }%0A%0A  # module.s3_alb_logs.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created%0A  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + region = "us-east-2"%0A%0A      + rule {%0A          + apply_server_side_encryption_by_default {%0A              + sse_algorithm     = "AES256"%0A                # (1 unchanged attribute hidden)%0A            }%0A        }%0A    }%0A%0A  # module.s3_alb_logs.aws_s3_bucket_versioning.this[0] will be created%0A  + resource "aws_s3_bucket_versioning" "this" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + region = "us-east-2"%0A%0A      + versioning_configuration {%0A          + mfa_delete = (known after apply)%0A          + status     = "Enabled"%0A        }%0A    }%0A%0A  # module.vpc.aws_db_subnet_group.database[0] will be created%0A  + resource "aws_db_subnet_group" "database" {%0A      + arn                     = (known after apply)%0A      + description             = "Database subnet group for aidoctors-vpc"%0A      + id                      = (known after apply)%0A      + name                    = "aidoctors-vpc"%0A      + name_prefix             = (known after apply)%0A      + region                  = "us-east-2"%0A      + subnet_ids              = (known after apply)%0A      + supported_network_types = (known after apply)%0A      + tags                    = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + tags_all                = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + vpc_id                  = (known after apply)%0A    }%0A%0A  # module.vpc.aws_default_network_acl.this[0] will be created%0A  + resource "aws_default_network_acl" "this" {%0A      + arn                    = (known after apply)%0A      + default_network_acl_id = (known after apply)%0A      + id                     = (known after apply)%0A      + owner_id               = (known after apply)%0A      + region                 = "us-east-2"%0A      + tags                   = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + tags_all               = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + vpc_id                 = (known after apply)%0A%0A      + egress {%0A          + action          = "allow"%0A          + from_port       = 0%0A          + ipv6_cidr_block = "::/0"%0A          + protocol        = "-1"%0A          + rule_no         = 101%0A          + to_port         = 0%0A            # (1 unchanged attribute hidden)%0A        }%0A      + egress {%0A          + action          = "allow"%0A          + cidr_block      = "0.0.0.0/0"%0A          + from_port       = 0%0A          + protocol        = "-1"%0A          + rule_no         = 100%0A          + to_port         = 0%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A      + ingress {%0A          + action          = "allow"%0A          + from_port       = 0%0A          + ipv6_cidr_block = "::/0"%0A          + protocol        = "-1"%0A          + rule_no         = 101%0A          + to_port         = 0%0A            # (1 unchanged attribute hidden)%0A        }%0A      + ingress {%0A          + action          = "allow"%0A          + cidr_block      = "0.0.0.0/0"%0A          + from_port       = 0%0A          + protocol        = "-1"%0A          + rule_no         = 100%0A          + to_port         = 0%0A            # (1 unchanged attribute hidden)%0A        }%0A    }%0A%0A  # module.vpc.aws_default_route_table.default[0] will be created%0A  + resource "aws_default_route_table" "default" {%0A      + arn                    = (known after apply)%0A      + default_route_table_id = (known after apply)%0A      + id                     = (known after apply)%0A      + owner_id               = (known after apply)%0A      + region                 = "us-east-2"%0A      + route                  = (known after apply)%0A      + tags                   = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + tags_all               = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + vpc_id                 = (known after apply)%0A%0A      + timeouts {%0A          + create = "5m"%0A          + update = "5m"%0A        }%0A    }%0A%0A  # module.vpc.aws_default_security_group.this[0] will be created%0A  + resource "aws_default_security_group" "this" {%0A      + arn                    = (known after apply)%0A      + description            = (known after apply)%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + region                 = "us-east-2"%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + tags_all               = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # module.vpc.aws_eip.nat[0] will be created%0A  + resource "aws_eip" "nat" {%0A      + allocation_id        = (known after apply)%0A      + arn                  = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = "vpc"%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + ipam_pool_id         = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + ptr_record           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + region               = "us-east-2"%0A      + tags                 = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + tags_all             = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A    }%0A%0A  # module.vpc.aws_eip.nat[1] will be created%0A  + resource "aws_eip" "nat" {%0A      + allocation_id        = (known after apply)%0A      + arn                  = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = "vpc"%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + ipam_pool_id         = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + ptr_record           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + region               = "us-east-2"%0A      + tags                 = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + tags_all             = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A    }%0A%0A  # module.vpc.aws_internet_gateway.this[0] will be created%0A  + resource "aws_internet_gateway" "this" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + owner_id = (known after apply)%0A      + region   = "us-east-2"%0A      + tags     = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + tags_all = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + vpc_id   = (known after apply)%0A    }%0A%0A  # module.vpc.aws_nat_gateway.this[0] will be created%0A  + resource "aws_nat_gateway" "this" {%0A      + allocation_id                      = (known after apply)%0A      + association_id                     = (known after apply)%0A      + connectivity_type                  = "public"%0A      + id                                 = (known after apply)%0A      + network_interface_id               = (known after apply)%0A      + private_ip                         = (known after apply)%0A      + public_ip                          = (known after apply)%0A      + region                             = "us-east-2"%0A      + secondary_allocation_ids           = (known after apply)%0A      + secondary_private_ip_address_count = (known after apply)%0A      + secondary_private_ip_addresses     = (known after apply)%0A      + subnet_id                          = (known after apply)%0A      + tags                               = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + tags_all                           = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A    }%0A%0A  # module.vpc.aws_nat_gateway.this[1] will be created%0A  + resource "aws_nat_gateway" "this" {%0A      + allocation_id                      = (known after apply)%0A      + association_id                     = (known after apply)%0A      + connectivity_type                  = "public"%0A      + id                                 = (known after apply)%0A      + network_interface_id               = (known after apply)%0A      + private_ip                         = (known after apply)%0A      + public_ip                          = (known after apply)%0A      + region                             = "us-east-2"%0A      + secondary_allocation_ids           = (known after apply)%0A      + secondary_private_ip_address_count = (known after apply)%0A      + secondary_private_ip_addresses     = (known after apply)%0A      + subnet_id                          = (known after apply)%0A      + tags                               = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + tags_all                           = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A    }%0A%0A  # module.vpc.aws_route.private_nat_gateway[0] will be created%0A  + resource "aws_route" "private_nat_gateway" {%0A      + destination_cidr_block = "0.0.0.0/0"%0A      + id                     = (known after apply)%0A      + instance_id            = (known after apply)%0A      + instance_owner_id      = (known after apply)%0A      + nat_gateway_id         = (known after apply)%0A      + network_interface_id   = (known after apply)%0A      + origin                 = (known after apply)%0A      + region                 = "us-east-2"%0A      + route_table_id         = (known after apply)%0A      + state                  = (known after apply)%0A%0A      + timeouts {%0A          + create = "5m"%0A        }%0A    }%0A%0A  # module.vpc.aws_route.private_nat_gateway[1] will be created%0A  + resource "aws_route" "private_nat_gateway" {%0A      + destination_cidr_block = "0.0.0.0/0"%0A      + id                     = (known after apply)%0A      + instance_id            = (known after apply)%0A      + instance_owner_id      = (known after apply)%0A      + nat_gateway_id         = (known after apply)%0A      + network_interface_id   = (known after apply)%0A      + origin                 = (known after apply)%0A      + region                 = "us-east-2"%0A      + route_table_id         = (known after apply)%0A      + state                  = (known after apply)%0A%0A      + timeouts {%0A          + create = "5m"%0A        }%0A    }%0A%0A  # module.vpc.aws_route.public_internet_gateway[0] will be created%0A  + resource "aws_route" "public_internet_gateway" {%0A      + destination_cidr_block = "0.0.0.0/0"%0A      + gateway_id             = (known after apply)%0A      + id                     = (known after apply)%0A      + instance_id            = (known after apply)%0A      + instance_owner_id      = (known after apply)%0A      + network_interface_id   = (known after apply)%0A      + origin                 = (known after apply)%0A      + region                 = "us-east-2"%0A      + route_table_id         = (known after apply)%0A      + state                  = (known after apply)%0A%0A      + timeouts {%0A          + create = "5m"%0A        }%0A    }%0A%0A  # module.vpc.aws_route_table.private[0] will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + region           = "us-east-2"%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + tags_all         = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table.private[1] will be created%0A  + resource "aws_route_table" "private" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + region           = "us-east-2"%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + tags_all         = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table.public[0] will be created%0A  + resource "aws_route_table" "public" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + region           = "us-east-2"%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + tags_all         = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.database[0] will be created%0A  + resource "aws_route_table_association" "database" {%0A      + id             = (known after apply)%0A      + region         = "us-east-2"%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.database[1] will be created%0A  + resource "aws_route_table_association" "database" {%0A      + id             = (known after apply)%0A      + region         = "us-east-2"%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.private[0] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + region         = "us-east-2"%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.private[1] will be created%0A  + resource "aws_route_table_association" "private" {%0A      + id             = (known after apply)%0A      + region         = "us-east-2"%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.public[0] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + region         = "us-east-2"%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.public[1] will be created%0A  + resource "aws_route_table_association" "public" {%0A      + id             = (known after apply)%0A      + region         = "us-east-2"%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.database[0] will be created%0A  + resource "aws_subnet" "database" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-2a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.3.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + region                                         = "us-east-2"%0A      + tags                                           = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + tags_all                                       = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.database[1] will be created%0A  + resource "aws_subnet" "database" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-2b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.6.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + region                                         = "us-east-2"%0A      + tags                                           = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + tags_all                                       = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.private[0] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-2a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.2.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + region                                         = "us-east-2"%0A      + tags                                           = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + tags_all                                       = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.private[1] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-2b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.5.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + region                                         = "us-east-2"%0A      + tags                                           = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + tags_all                                       = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.public[0] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-2a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.1.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + region                                         = "us-east-2"%0A      + tags                                           = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + tags_all                                       = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.public[1] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-2b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.4.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + region                                         = "us-east-2"%0A      + tags                                           = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + tags_all                                       = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_vpc.this[0] will be created%0A  + resource "aws_vpc" "this" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = "10.0.0.0/16"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_dns_hostnames                 = true%0A      + enable_dns_support                   = true%0A      + enable_network_address_usage_metrics = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + region                               = "us-east-2"%0A      + tags                                 = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A      + tags_all                             = {%0A          + "Name" = "aidoctors-vpc"%0A        }%0A    }%0A%0A  # module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_iam_policy_document" "enhanced_monitoring" {%0A      + id            = (known after apply)%0A      + json          = (known after apply)%0A      + minified_json = (known after apply)%0A%0A      + statement {%0A          + actions = [%0A              + "sts:AssumeRole",%0A            ]%0A%0A          + principals {%0A              + identifiers = [%0A                  + "monitoring.rds.amazonaws.com",%0A                ]%0A              + type        = "Service"%0A            }%0A        }%0A    }%0A%0A  # module.db.module.db_instance.data.aws_partition.current will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_partition" "current" {%0A      + dns_suffix         = (known after apply)%0A      + id                 = (known after apply)%0A      + partition          = (known after apply)%0A      + reverse_dns_prefix = (known after apply)%0A    }%0A%0A  # module.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"] will be created%0A  + resource "aws_cloudwatch_log_group" "this" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + log_group_class   = (known after apply)%0A      + name              = "/aws/rds/instance/aidoctors-db/postgresql"%0A      + name_prefix       = (known after apply)%0A      + region            = "us-east-2"%0A      + retention_in_days = 7%0A      + skip_destroy      = false%0A      + tags              = {%0A          + "Name" = "aidoctors-postgres"%0A        }%0A      + tags_all          = {%0A          + "Name" = "aidoctors-postgres"%0A        }%0A    }%0A%0A  # module.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"] will be created%0A  + resource "aws_cloudwatch_log_group" "this" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + log_group_class   = (known after apply)%0A      + name              = "/aws/rds/instance/aidoctors-db/upgrade"%0A      + name_prefix       = (known after apply)%0A      + region            = "us-east-2"%0A      + retention_in_days = 7%0A      + skip_destroy      = false%0A      + tags              = {%0A          + "Name" = "aidoctors-postgres"%0A        }%0A      + tags_all          = {%0A          + "Name" = "aidoctors-postgres"%0A        }%0A    }%0A%0A  # module.db.module.db_instance.aws_db_instance.this[0] will be created%0A  + resource "aws_db_instance" "this" {%0A      + address                               = (known after apply)%0A      + allocated_storage                     = 20%0A      + allow_major_version_upgrade           = false%0A      + apply_immediately                     = false%0A      + arn                                   = (known after apply)%0A      + auto_minor_version_upgrade            = true%0A      + availability_zone                     = (known after apply)%0A      + backup_retention_period               = 7%0A      + backup_target                         = (known after apply)%0A      + backup_window                         = "03:00-06:00"%0A      + ca_cert_identifier                    = (known after apply)%0A      + character_set_name                    = (known after apply)%0A      + copy_tags_to_snapshot                 = false%0A      + database_insights_mode                = (known after apply)%0A      + db_name                               = "aidoctorsdb"%0A      + db_subnet_group_name                  = (known after apply)%0A      + dedicated_log_volume                  = false%0A      + delete_automated_backups              = true%0A      + deletion_protection                   = false%0A      + domain_fqdn                           = (known after apply)%0A      + enabled_cloudwatch_logs_exports       = [%0A          + "postgresql",%0A          + "upgrade",%0A        ]%0A      + endpoint                              = (known after apply)%0A      + engine                                = "postgres"%0A      + engine_lifecycle_support              = "open-source-rds-extended-support-disabled"%0A      + engine_version                        = "17.6"%0A      + engine_version_actual                 = (known after apply)%0A      + hosted_zone_id                        = (known after apply)%0A      + iam_database_authentication_enabled   = true%0A      + id                                    = (known after apply)%0A      + identifier                            = "aidoctors-db"%0A      + identifier_prefix                     = (known after apply)%0A      + instance_class                        = "db.t4g.micro"%0A      + iops                                  = (known after apply)%0A      + kms_key_id                            = (known after apply)%0A      + latest_restorable_time                = (known after apply)%0A      + license_model                         = (known after apply)%0A      + listener_endpoint                     = (known after apply)%0A      + maintenance_window                    = "mon:00:00-mon:03:00"%0A      + manage_master_user_password           = true%0A      + master_user_secret                    = (known after apply)%0A      + master_user_secret_kms_key_id         = (known after apply)%0A      + max_allocated_storage                 = 50%0A      + monitoring_interval                   = 60%0A      + monitoring_role_arn                   = (known after apply)%0A      + multi_az                              = true%0A      + nchar_character_set_name              = (known after apply)%0A      + network_type                          = (known after apply)%0A      + option_group_name                     = (known after apply)%0A      + parameter_group_name                  = (known after apply)%0A      + password_wo                           = (write-only attribute)%0A      + performance_insights_enabled          = false%0A      + performance_insights_kms_key_id       = (known after apply)%0A      + performance_insights_retention_period = (known after apply)%0A      + port                                  = 5432%0A      + publicly_accessible                   = false%0A      + region                                = "us-east-2"%0A      + replica_mode                          = (known after apply)%0A      + replicas                              = (known after apply)%0A      + resource_id                           = (known after apply)%0A      + skip_final_snapshot                   = true%0A      + snapshot_identifier                   = (known after apply)%0A      + status                                = (known after apply)%0A      + storage_encrypted                     = true%0A      + storage_throughput                    = (known after apply)%0A      + storage_type                          = (known after apply)%0A      + tags                                  = {%0A          + "Name" = "aidoctors-postgres"%0A        }%0A      + tags_all                              = {%0A          + "Name" = "aidoctors-postgres"%0A        }%0A      + timezone                              = (known after apply)%0A      + username                              = "aidoctors_admin"%0A      + vpc_security_group_ids                = (known after apply)%0A%0A      + timeouts {}%0A    }%0A%0A  # module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0] will be created%0A  + resource "aws_iam_role" "enhanced_monitoring" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = (known after apply)%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "aidoctors-rds-monitoring-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags                  = {%0A          + "Name" = "aidoctors-postgres"%0A        }%0A      + tags_all              = {%0A          + "Name" = "aidoctors-postgres"%0A        }%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy (known after apply)%0A    }%0A%0A  # module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0] will be created%0A  + resource "aws_iam_role_policy_attachment" "enhanced_monitoring" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "aidoctors-rds-monitoring-role"%0A    }%0A%0A  # module.db.module.db_instance.aws_secretsmanager_secret_rotation.this[0] will be created%0A  + resource "aws_secretsmanager_secret_rotation" "this" {%0A      + id                 = (known after apply)%0A      + region             = "us-east-2"%0A      + rotate_immediately = false%0A      + rotation_enabled   = (known after apply)%0A      + secret_id          = (known after apply)%0A%0A      + rotation_rules {%0A          + schedule_expression = "rate(30 days)"%0A        }%0A    }%0A%0A  # module.db.module.db_parameter_group.aws_db_parameter_group.this[0] will be created%0A  + resource "aws_db_parameter_group" "this" {%0A      + arn          = (known after apply)%0A      + description  = "aidoctors-db parameter group"%0A      + family       = "postgres17"%0A      + id           = (known after apply)%0A      + name         = (known after apply)%0A      + name_prefix  = "aidoctors-db-"%0A      + region       = "us-east-2"%0A      + skip_destroy = false%0A      + tags         = {%0A          + "Name" = "aidoctors-db"%0A        }%0A      + tags_all     = {%0A          + "Name" = "aidoctors-db"%0A        }%0A%0A      + parameter {%0A          + apply_method = "immediate"%0A          + name         = "autovacuum"%0A          + value        = "1"%0A        }%0A      + parameter {%0A          + apply_method = "immediate"%0A          + name         = "client_encoding"%0A          + value        = "utf8"%0A        }%0A      + parameter {%0A          + apply_method = "immediate"%0A          + name         = "log_connections"%0A          + value        = "1"%0A        }%0A    }%0A%0APlan: 75 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + db_instance_master_user_secret_arn = (known after apply)%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Pusher: @TerryTian21, Action: `pull_request`, Workflow: `Terraform PR Check`*